kine_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
     @mode ="Vue"
     @user = User.find(params[:id])